# Используем легковесный официальный образ Node.js
FROM node:18-alpine

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем package.json и package-lock.json для установки зависимостей
COPY package*.json ./

# Устанавливаем зависимости
RUN npm install

# Копируем весь проект в рабочую директорию контейнера
COPY . .

# Собираем приложение для production
RUN npm run build

# Открываем порт 3000 для доступа к приложению
EXPOSE 3000

# Команда по умолчанию для запуска приложения
CMD ["npm", "start"]